Revit 2027 API
ParameterTypeId.StairsLandingtypeUseSameTriserAsRun Property
 "Same as Run": Same as Run
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsLandingtypeUseSameTriserAsRun { get; }
Public Shared ReadOnly Property StairsLandingtypeUseSameTriserAsRun As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsLandingtypeUseSameTriserAsRun {
	ForgeTypeId^ get ();
}
static member StairsLandingtypeUseSameTriserAsRun : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace